experiments/data/stats/ycsb_e_run5.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 13485
[OVERALL], Throughput(ops/sec), 74156.47015202076
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 28
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.20763811642565813
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 28
[TOTAL_GC_TIME_%], Time(%), 0.20763811642565813
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3167232.0
[CLEANUP], MinLatency(us), 3166208
[CLEANUP], MaxLatency(us), 3168255
[CLEANUP], 50thPercentileLatency(us), 3168255
[CLEANUP], 95thPercentileLatency(us), 3168255
[CLEANUP], 99thPercentileLatency(us), 3168255
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.039583
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 18383
[INSERT], 50thPercentileLatency(us), 8
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 19
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 136233
[OVERALL], Throughput(ops/sec), 7340.365403389781
[TOTAL_GCS_G1_Young_Generation], Count, 70
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 973
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7142175537498257
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 70
[TOTAL_GC_TIME], Time(ms), 973
[TOTAL_GC_TIME_%], Time(%), 0.7142175537498257
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3065.0
[CLEANUP], MinLatency(us), 3064
[CLEANUP], MaxLatency(us), 3065
[CLEANUP], 50thPercentileLatency(us), 3065
[CLEANUP], 95thPercentileLatency(us), 3065
[CLEANUP], 99thPercentileLatency(us), 3065
[SCAN-LATENCY-PER-RECORD], Operations, 950223
[SCAN-LATENCY-PER-RECORD], AverageLatency(us), 2.713663003316064
[SCAN-LATENCY-PER-RECORD], MinLatency(us), 0
[SCAN-LATENCY-PER-RECORD], MaxLatency(us), 2435
[SCAN-LATENCY-PER-RECORD], 50thPercentileLatency(us), 2
[SCAN-LATENCY-PER-RECORD], 95thPercentileLatency(us), 5
[SCAN-LATENCY-PER-RECORD], 99thPercentileLatency(us), 13
[INSERT], Operations, 49777
[INSERT], AverageLatency(us), 17.21475781987665
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 11079
[INSERT], 50thPercentileLatency(us), 16
[INSERT], 95thPercentileLatency(us), 23
[INSERT], 99thPercentileLatency(us), 31
[INSERT], Return=OK, 49777
[SCAN], Operations, 950223
[SCAN], AverageLatency(us), 138.1932399026334
[SCAN], MinLatency(us), 4
[SCAN], MaxLatency(us), 157567
[SCAN], 50thPercentileLatency(us), 131
[SCAN], 95thPercentileLatency(us), 258
[SCAN], 99thPercentileLatency(us), 324
[SCAN], Return=OK, 950223