experiments/data/stats/ycsb_f_run1.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadf -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 13871
[OVERALL], Throughput(ops/sec), 72092.85559801024
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 33
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.23790642347343377
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 33
[TOTAL_GC_TIME_%], Time(%), 0.23790642347343377
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1971712.0
[CLEANUP], MinLatency(us), 1971200
[CLEANUP], MaxLatency(us), 1972223
[CLEANUP], 50thPercentileLatency(us), 1972223
[CLEANUP], 95thPercentileLatency(us), 1972223
[CLEANUP], 99thPercentileLatency(us), 1972223
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 10.518338
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 47007
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 15
[INSERT], 99thPercentileLatency(us), 29
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadf -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 32294
[OVERALL], Throughput(ops/sec), 30965.50442806713
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 59
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.18269647612559609
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 59
[TOTAL_GC_TIME_%], Time(%), 0.18269647612559609
[READ], Operations, 1000000
[READ], AverageLatency(us), 17.454312
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 15039
[READ], 50thPercentileLatency(us), 15
[READ], 95thPercentileLatency(us), 54
[READ], 99thPercentileLatency(us), 74
[READ], Return=OK, 1000000
[READ-MODIFY-WRITE], Operations, 499725
[READ-MODIFY-WRITE], AverageLatency(us), 35.09551253189254
[READ-MODIFY-WRITE], MinLatency(us), 9
[READ-MODIFY-WRITE], MaxLatency(us), 42175
[READ-MODIFY-WRITE], 50thPercentileLatency(us), 32
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 77
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 98
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 99040.0
[CLEANUP], MinLatency(us), 99008
[CLEANUP], MaxLatency(us), 99071
[CLEANUP], 50thPercentileLatency(us), 99071
[CLEANUP], 95thPercentileLatency(us), 99071
[CLEANUP], 99thPercentileLatency(us), 99071
[UPDATE], Operations, 499725
[UPDATE], AverageLatency(us), 16.682703486917806
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 42111
[UPDATE], 50thPercentileLatency(us), 15
[UPDATE], 95thPercentileLatency(us), 28
[UPDATE], 99thPercentileLatency(us), 37
[UPDATE], Return=OK, 499725